cases/NASA-hump/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   uniform 300;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    lowerWall
    {
        Cmu             0.09;
        kappa           0.41;
        E               9.800000000000001;
        beta1           0.075;
        blended         true;
        type            omegaWallFunction;
        value           uniform 300;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            slip;
    }
}


// ************************************************************************* //
