cases/NASA-hump/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
// libs            (sampling);

interpolationScheme cellPoint;

setFormat       raw;
surfaceFormat 	raw;

fields          (U);

sets
(
    x1p00
    {
        type    uniform;
        axis    y;
        start   (1.0 0.0 0.5);
        end     (1.0 0.25 0.5);
        nPoints 1000;
    }

    x1p05
    {
        type    uniform;
        axis    y;
        start   (1.05 0.0 0.5);
        end     (1.05 0.25 0.5);
        nPoints 1000;
    }

    x1p10
    {
        type    uniform;
        axis    y;
        start   (1.10 0.0 0.5);
        end     (1.10 0.25 0.5);
        nPoints 1000;
    }

    x1p15
    {
        type    uniform;
        axis    y;
        start   (1.15 0.0 0.5);
        end     (1.15 0.25 0.5);
        nPoints 1000;
    }

    x1p20
    {
        type    uniform;
        axis    y;
        start   (1.20 0.0 0.5);
        end     (1.20 0.25 0.5);
        nPoints 1000;
    }
    
);

surfaces ();



// ************************************************************************* //
